doc updated with image and marmeid
